// Вычислите площадь квадрата по длине стороны.
#include <iostream>
using namespace std;

int main()
{
	int a;
	cout << "Введите длину: ";
	cin >> a;
	cout << "Площадь: " << a * a << endl;
}
