// Напишите программу, которая выводит на экран ваше имя.
#include <iostream>
using namespace std;

int main()
{
	cout << "Дима" << endl;
}
