// Выведите на экран звёздочки в виде прямоугольного треугольника.
#include <iostream>
using namespace std;

int main()
{
	cout << "*"  << endl;
	cout << "**"  << endl;
	cout << "***"  << endl;
	cout << "****"  << endl;
	cout << "*****"  << endl;
}
